performanceTest/load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 600
      arrivalRate: 50
      rampTo: 600
      name: "Warm up"
    - duration: 7200
      arrivalRate: 600
      name: "test"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - flow:
      - post:
          url: "/payment"
          json:
            amount: "{{ $randomInt(1, 1000) }}"
            currency: "USD"
            description: "Test payment"