performanceTest/load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 120
      arrivalRate: 50
      rampTo: 300
    - duration: 900
      arrivalRate: 300
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - flow:
      - post:
          url: "/payment"
          json:
            amount: "{{ $randomInt(1, 1000) }}"
            currency: "USD"
            description: "Test payment"